---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SpecifiedAnglesNotCompatibleWithLayoutWarning
source: html/ee9c32a9-5f9c-b976-128e-32381e1096f7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SpecifiedAnglesNotCompatibleWithLayoutWarning Property

The specified angles are not compatible with current layout.

## Syntax (C#)
```csharp
public static FailureDefinitionId SpecifiedAnglesNotCompatibleWithLayoutWarning { get; }
```